fixed digaram format
